# language: ru

Функция: Добавление товара

  Предыстория:
    * страница "Главная страница" загружена
    * выполнено нажатие на "Песочница"
    * нажатием на кнопку "Товары" загружена страница "Список товаров"
    * нажатием на кнопку "Добавить" загружена страница "Добавление товара"

  Структура сценария: Успешное добавление товара <name> <type> <exotic>
    * заполняются поля:
      | field                      | value    |
      | Поле Наименование          | <name>   |
      | Комбинированный список Тип | <type>   |
      | Чекбокс Экзотический       | <exotic> |
    * выполнено нажатие на "Сохранить"
    * страница "Список товаров" загружена
    * ожидается появление элементов коллекции "Таблица" в течение "10" секунд
    * количество элементов коллекции "Таблица" равно "5"

    * присутствует элемент коллекции "Таблица" с параметрами:
      | field        | value    |
      | Наименование | <name>   |
      | Тип          | <type>   |
      | Экзотический | <exotic> |

    * выполнено нажатие на "Песочница"
    * выполнено нажатие на "Сброс данных"
    * нажатием на кнопку "QualIT" загружена страница "Главная страница"

    Примеры:
      | name      | type  | exotic |
      | абв       | Овощ  | true   |
      | 1         | Фрукт | false  |
      | *?!       | Овощ  | false  |
      | аб*в12?!3 | Фрукт | true   |

#  Сценарий: Некорректное добавление товара
#    * значение ошибки в поле "Поле Наименование" соответствует "Поле Наименование не заполнено / заполнено неправильно!"
