# language: ru

# Тестовые данные:

Функция: Добавление товара в БД

  Структура сценария: Добавление товара в БД <name> <type> <exotic>
    * к БД выполнено подключение "H2" с параметрами:
      | field        | value |
      | Пользователь | user  |
      | Пароль       | pass  |

    * к БД выполняется запрос "Перечень товаров"
    * количество элементов коллекции "Перечень товаров" не равно нулю
    * к БД выполняется запрос "Добавление товара" c параметрами:
      | field        | value    |
      | Название     | <name>   |
      | Тип          | <type>   |
      | Экзотический | <exotic> |
    * из БД выбирается строка запросом "Получение товара" c параметрами:
      | field        | value    |
      | Название     | <name>   |
      | Тип          | <type>   |
      | Экзотический | <exotic> |
    * к БД выполняется запрос "Удаление товара" c параметрами:
      | field        | value    |
      | Название     | <name>   |
      | Тип          | <type>   |
      | Экзотический | <exotic> |
    * закрыто подключение к БД

    Примеры:
      | name      | type  | exotic |
      | абв       | Овощ  | true   |
      | 1         | Фрукт | false  |
      | *?!       | Овощ  | false  |
      | аб*в12?!3 | Фрукт | true   |