# language: ru

# Тестовые данные:

Функция: Добавление товара в БД

  Структура сценария: Добавление товара в БД <name> <type> <exotic>
    * к БД выполнено подключение "H2" с параметрами:
      | field        | value |
      | Пользователь | user  |
      | Пароль       | pass  |

    * к БД выполняется запрос "Перечень товаров"
    * количество элементов коллекции "Перечень товаров" не равно нулю
    * количество элементов коллекции "Перечень товаров" равно "4"

    * к БД выполняется запрос "Добавление товара" c параметрами:
      | field        | value    |
      | Название     | <name>   |
      | Тип          | <type>   |
      | Экзотический | <exotic> |
    * к БД выполняется запрос "Перечень товаров"
    * количество элементов коллекции "Перечень товаров" равно "5"

    * из БД выбирается строка запросом "Получение товара" c параметрами:
      | field        | value    |
      | Название     | <name>   |
      | Тип          | <type>   |
      | Экзотический | <exotic> |
    * значение поля "Название" равно "<name>"
    * значение поля "Тип" равно "<type>"
    * значение поля "Экзотический" равно "<exotic>"

    * к БД выполняется запрос "Удаление товара" c параметрами:
      | field        | value    |
      | Название     | <name>   |
      | Тип          | <type>   |
      | Экзотический | <exotic> |
    * к БД выполняется запрос "Перечень товаров"
    * количество элементов коллекции "Перечень товаров" равно "4"

    * закрыто подключение к БД

    Примеры:
      | name      | type  | exotic |
      | абв       | Овощ  | 1      |
      | 1         | Фрукт | 0      |
      | *?!       | Овощ  | 0      |
      | аб*в12?!3 | Фрукт | 1      |